#!/bin/bash
# 参考：https://www.cnblogs.com/Spiro-K/p/6592518.html

echo -e "======================================================="
echo -e "Shell Colors Usage"
echo -e "======================================================="


#字符颜色显示
#-e:允许echo使用转义
#\033[:开始位
#\033[0m:结束位
#\033等同于\e
echo -e "\n字符颜色显示: 30 ~ 37"
echo -e -n "\033[30m 黑色字 \033[0m"  
echo -e -n "\033[31m 红色字 \033[0m"  
echo -e -n "\033[32m 绿色字 \033[0m"  
echo -e -n "\033[33m 黄色字 \033[0m"  
echo -e -n "\033[34m 蓝色字 \033[0m"  
echo -e -n "\033[35m 紫色字 \033[0m"  
echo -e -n "\033[36m 天蓝字 \033[0m"  
echo -e -n "\033[37m 白色字 \033[0m"  
echo -e "\n"


# 背景颜色范围:40-47  
echo -e "\n背景颜色显示:"
echo -e -n "\033[40m 黑底白字 \033[0m"  
echo -e -n "\033[41m 红底白字 \033[0m"  
echo -e -n "\033[42m 绿底白字 \033[0m"  
echo -e -n "\033[43m 黄底白字 \033[0m"  
echo -e -n "\033[44m 蓝底白字 \033[0m"  
echo -e -n "\033[45m 紫底白字 \033[0m"  
echo -e -n "\033[46m 天蓝底白字 \033[0m"  
echo -e -n "\033[47m 白底白字 \033[0m" 
echo -e "\n"


# 字符颜色与背景颜色用;号相隔
echo -e "\n字符,背景颜色显示:"
echo -e -n "\033[40;37m 黑底白字 \033[0m"  
echo -e -n "\033[41;30m 红底黑字 \033[0m"  
echo -e -n "\033[42;34m 绿底蓝字 \033[0m"  
echo -e -n "\033[43;34m 黄底蓝字 \033[0m"  
echo -e -n "\033[44;30m 蓝底黑字 \033[0m"  
echo -e -n "\033[45;30m 紫底黑字 \033[0m"  
echo -e -n "\033[46;30m 天蓝底黑字 \033[0m"  
echo -e -n "\033[47;34m 白底蓝字 \033[0m" 
echo -e "\n"


#0:关闭特殊效果
#1:高亮显示
#4:下划线
#5:闪烁
#7:反白显示
#8:隐藏不可见
#特殊效果和颜色用;号相隔,没有顺序
echo -e "\n颜色和特殊效果显示:"
echo -e "\033[0;46;30m 关闭特殊效果: 天蓝底黑字 \033[0m"  
echo -e "\033[1;46;30m 高亮显示: 天蓝底黑字 \033[0m"  
echo -e "\033[4;46;30m 下划线: 天蓝底黑字 \033[0m"  
echo -e "\033[5;46;30m 闪烁: 天蓝底黑字 \033[0m"  
echo -e "\033[7;46;30m 反白显示: 天蓝底黑字 \033[0m"  
echo -e "\033[8;46;30m 隐藏不可见: 天蓝底黑字 \033[0m"
echo -e "\n"
